In [1]:
import numpy as np
import pandas as pd

In [2]:
date = pd.read_csv('orders.csv')
time = pd.read_csv('messages.csv')

In [28]:
date.head(4)

        date  product_id  city_id  orders  date_year date_month   date_day
0 2019-12-10        5628       25       3       2019   December    Tuesday
1 2018-08-15        3646       14     157       2018     August  Wednesday
2 2018-10-23        1859       25       1       2018    October    Tuesday
3 2019-08-17        7292       25       1       2019     August   Saturday

In [29]:
time.head(4)

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...

In [31]:
date.drop(['product_id','city_id','city_id'],axis=1,inplace=True)

# Working with dates

In [32]:
date['date'] = pd.to_datetime(date['date'])

In [33]:
date.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   date        1000 non-null   datetime64[ns]
 1   orders      1000 non-null   int64
 2   date_year   1000 non-null   int64
 3   date_month  1000 non-null   object
 4   date_day    1000 non-null   object
dtypes: datetime64[ns](1), int64(2), object(2)
memory usage: 39.2+ KB

## 1.Extract Year

In [34]:
date['date_year'] = date['date'].dt.year

In [35]:
date.head(4)

        date  orders  date_year date_month   date_day
0 2019-12-10       3       2019   December    Tuesday
1 2018-08-15     157       2018     August  Wednesday
2 2018-10-23       1       2018    October    Tuesday
3 2019-08-17       1       2019     August   Saturday

## 2. Extract Month

In [36]:
date['date_month'] = date['date'].dt.month_name()

In [37]:
date.head(4)

        date  orders  date_year date_month   date_day
0 2019-12-10       3       2019   December    Tuesday
1 2018-08-15     157       2018     August  Wednesday
2 2018-10-23       1       2018    October    Tuesday
3 2019-08-17       1       2019     August   Saturday

## 3. Extract day

In [38]:
date['date_day'] = date['date'].dt.day_name()

In [39]:
date.head(4)

        date  orders  date_year date_month   date_day
0 2019-12-10       3       2019   December    Tuesday
1 2018-08-15     157       2018     August  Wednesday
2 2018-10-23       1       2018    October    Tuesday
3 2019-08-17       1       2019     August   Saturday

In [40]:
date['day_of_week'] = date['date'].dt.dayofweek

In [41]:
date.head(4)

        date  orders  date_year date_month   date_day  day_of_week
0 2019-12-10       3       2019   December    Tuesday            1
1 2018-08-15     157       2018     August  Wednesday            2
2 2018-10-23       1       2018    October    Tuesday            1
3 2019-08-17       1       2019     August   Saturday            5

# Extract Week of year

In [46]:
date['date_week'] = date['date'].dt.week

C:\Users\PC\AppData\Local\Temp\ipykernel_27216\3869037006.py:1: FutureWarning: Series.dt.weekofyear and Series.dt.week have been deprecated. Please use Series.dt.isocalendar().week instead.
  date['date_week'] = date['date'].dt.week

In [47]:
date.head(4)

        date  orders  date_year date_month   date_day  day_of_week  date_week
0 2019-12-10       3       2019   December    Tuesday            1         50
1 2018-08-15     157       2018     August  Wednesday            2         33
2 2018-10-23       1       2018    October    Tuesday            1         43
3 2019-08-17       1       2019     August   Saturday            5         33

# Extract Quater

In [49]:
date['date_quater'] = date['date'].dt.quarter

In [50]:
date.head(4)

,date,orders,date_year,date_month,date_day,day_of_week,date_week,date_quater
0,2019-12-10,3,2019,December,Tuesday,1,50,4
1,2018-08-15,157,2018,August,Wednesday,2,33,3
2,2018-10-23,1,2018,October,Tuesday,1,43,4
3,2019-08-17,1,2019,August,Saturday,5,33,3

# Extract Semester

In [52]:
date['date_semester'] = np.where(date['date_quater'].isin([1,2]),1,2)

In [53]:
date.head(4)

,date,orders,date_year,date_month,date_day,day_of_week,date_week,date_quater,date_semester
0,2019-12-10,3,2019,December,Tuesday,1,50,4,2
1,2018-08-15,157,2018,August,Wednesday,2,33,3,2
2,2018-10-23,1,2018,October,Tuesday,1,43,4,2
3,2019-08-17,1,2019,August,Saturday,5,33,3,2

# Extract Time elapsed between dates

In [54]:
import datetime

In [64]:
today = datetime.datetime.today()

In [65]:
today

datetime.datetime(2023, 4, 4, 6, 2, 3, 89978)

In [94]:
((today - date['date']).dt.days/365)*12

0      39.813699
1      55.660274
2      53.391781
3      43.594521
4      50.926027
         ...
995    53.884932
996    51.945205
997    46.947945
998    49.084932
999    41.654795
Name: date, Length: 1000, dtype: float64

# Time Datasets

In [96]:
time.head(6)

                  date                                                msg
0  2013-12-15 00:50:00                           ищу на сегодня мужика 37
1  2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2  2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3  2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...
4  2013-10-26 23:11:00    Зая я тебя никогда не обижу  люблю тебя!)  Даше
5  2016-03-08 22:52:00  пар.32прок.дев.на авто по ночн.городу.Днепр.06...

In [97]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   object
 1   msg     1000 non-null   object
dtypes: object(2)
memory usage: 15.8+ KB

In [99]:
time['date'] = pd.to_datetime(time['date'])

In [101]:
time.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   date    1000 non-null   datetime64[ns]
 1   msg     1000 non-null   object
dtypes: datetime64[ns](1), object(1)
memory usage: 15.8+ KB

In [102]:
time.head(4)

                 date                                                msg
0 2013-12-15 00:50:00                           ищу на сегодня мужика 37
1 2014-04-29 23:40:00   ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826
2 2012-12-30 00:21:00           Днепр.м 43 позн.с д/ж *.о  067.16.34.576
3 2014-11-28 00:31:00  КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...

# Extract Time

In [103]:
time['time'] = time['date'].dt.time

In [104]:
time.head(4)

,date,msg,time
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,00:50:00
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23:40:00
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,00:21:00
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,00:31:00

## Extract Hour Minute Second

In [105]:
time['hour'] = time['date'].dt.hour
time['minute'] = time['date'].dt.minute
time['second'] = time['date'].dt.second

In [106]:
time.head(4)

,date,msg,time,hour,minute,second
0,2013-12-15 00:50:00,ищу на сегодня мужика 37,00:50:00,0,50,0
1,2014-04-29 23:40:00,ПАРЕНЬ БИ ИЩЕТ ДРУГА СЕЙЧАС!! СМС ММС 0955532826,23:40:00,23,40,0
2,2012-12-30 00:21:00,Днепр.м 43 позн.с д/ж *.о 067.16.34.576,00:21:00,0,21,0
3,2014-11-28 00:31:00,КИЕВ ИЩУ Д/Ж ДО 45 МНЕ СЕЙЧАС СКУЧНО 093 629 9...,00:31:00,0,31,0

In [127]:
(today - time['date'])/np.timedelta64(1,'M')

0      111.615161
1      107.148494
2      123.115032
3      100.182095
4      113.227309
          ...
995    132.609432
996    110.303156
997    125.580152
998    129.391387
999    105.473237
Name: date, Length: 1000, dtype: float64

In [142]:
((today - time['date']).dt.days/365)*12

0      111.682192
1      107.210959
2      123.189041
3      100.241096
4      113.293151
          ...
995    132.690411
996    110.367123
997    125.654795
998    129.468493
999    105.534247
Name: date, Length: 1000, dtype: float64